## Plan Result (@infrastructure/account-data-deleter-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/15124236900)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * aws_appautoscaling_target.data-deleter-app_application_autoscaling_autoscaling_target_02FF0938
* Replace
  * aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_appautoscaling_target.data-deleter-app_application_autoscaling_autoscaling_target_02FF0938 will be updated in-place
  ~ resource "aws_appautoscaling_target" "data-deleter-app_application_autoscaling_autoscaling_target_02FF0938" {
        id                 = "service/AccountDataDeleter-Prod/AccountDataDeleter-Prod"
      ~ max_capacity       = 3 -> 100
      ~ min_capacity       = 2 -> 10
        tags               = {}
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07 must be replaced
-/+ resource "aws_ecs_task_definition" "data-deleter-app_application_ecs_service_ecs-task_243DED07" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/AccountDataDeleter-Prod:920" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/AccountDataDeleter-Prod" -> (known after apply)
      ~ cpu                      = "512" -> "2048" # forces replacement
      ~ id                       = "AccountDataDeleter-Prod" -> (known after apply)
      ~ memory                   = "2048" -> "16384" # forces replacement
      ~ revision                 = 920 -> (known after apply)
        tags                     = {
            "app_code"       = "pocket"
            "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ ecs-task-arn                                                                              = "arn:aws:ecs:us-east-1:996905175585:task-definition/AccountDataDeleter-Prod:920" -> (known after apply)
```

</details>







## :warning: Errors

* add a label @infrastructure/account-data-deleter-production/destroy: POST https://api.github.com/repos/Pocket/pocket-monorepo/issues/1050/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]


<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":1050,"Program":"tfcmt","SHA1":"2061208c2afe6ff60bbbe1b805475b20b3449fff","Target":"@infrastructure/account-data-deleter-production","Vars":{},"WorkflowName":"Account Data Deleter"} -->